// 1.Дан не пустой массив целых чисел.
// Написать метод, находящий количество четных чисел в нем.
// {1,8,3,6}-> 2

//2. Написать метод, возвращающий максимальный элемент массива целых чисел
// {1,8,3,6}-> 8

//3. Написать метод, возвращающмй  разность между максимальным и минимальным элементами
// массива целых чисел  {1,8,3,6}-> 7

// во всех задачах массивы содержат больше 1 элемента.
//  В масивах все числа разные



public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}