// ДЗ.1
// Напишите функцию filterRange(arr, a, b), которая принимает массив arr,
// ищет элементы со значениями больше или величинами a и меньше или
// необычными b и возвращаются результаты в виде массива.

// Функция должна возвращать новый массив и не изменять исходный.

// function  filterRange2 ( обр ,  а ,  б )  {
//     возврат  обр . filter ( ( item )  =>  item  >=  a  &&  item  <=  b ) ;
//   }
  
//   пусть  arr  =  [ 5 ,  3 ,  8 ,  1 ,  2 ,  1 ,  1 ,  4 ,  12 ,  5 ] ;
//   пусть  отфильтровано  =  filterRange2 ( arr ,  1 ,  4 ) ;
  
//   консоль . log ( "Исходный массив:" ) ;
//   консоль . журнал ( обр ) ;
  
//   консоль . log ( "Новый массив:" ) ;
//   консоль . журнал ( отфильтрованный ) ;
  
//   консоль . журнал ( "-------------------" ) ;
  


  // ДЗ.2 Напишите функцию filterRangeInPlace(arr, a, b),
  // которая составляет массив arr и вычисляет из него все значения, кроме тех,
  // которые находятся между a и b.
  
  // Функция должна изменять принимаемый массив и ничего не возвращать.
  
  функция  filterRangeInPlace ( обр ,  а ,  б )  {
    for  ( пусть  я  =  0 ;  я  <  обр . длина ;  я ++ )  {
      если  ( обр [ я ]  <  а  ||  обр [ я ]  >  б )  {
        обр . соединение ( я ,  1 ) ;
        я -- ;
      }
    }
  }
  
  пусть  arr2  =  [ 5 ,  3 ,  8 ,  1 ,  2 ,  1 ,  1 ,  4 ,  12 ,  5 ] ;
  
  консоль . log ( "Исходный массив:" ) ;
  консоль . журнал ( обр2 ) ;
  
  filterRangeInPlace ( arr2 ,  1 ,  4 ) ;
  консоль . log ( "Исходный массив с изменениями:" ) ;
  консоль . журнал ( обр2 ) ;