let userName = 'Jone';
let admin = userName;
console.log(admin);

let myPlanet;
let userOnline;


// 	- У нас есть новый дом на 1000 квартир
		// 	- 100 квартир купили в кредит
		// 	- 100 квартир купили за наличные
		// 	- 200 квартир арендовали
		// 	- Оставшиеся квартиры стоят пустые

// 	- Сколько всего квартир уже занято?
		// 	- Сколько квартир ещё нужно занять?

		// 	- Чего больше занятых квартир или не занятых? (вывести значение в консоль)


		// 	- в зависимости от того каких квартир больше 
		// 	выводите в консоль сообщение об этом 'У нас больше пустых квартир' или 'У нас больше занятых квартир'


        
