public class Main {

    public static void main(String[] args) {
        // write your code here

        System.out.println("Hello world!");
        System.out.println(54+16);
        System.out.println(50/3);
        System.out.println(-5 + 8*6);

        int aPrice=1000;
        int bPrace=500;
        int discout =100;
        int result= aPrice


    }
             //1.Написать программу, которая выводит на экран сумму 2 чисел 54 и 16
            //2.Написать программу, которая выводит на экран результат деления  2 чисел 50 и 3
            //3. Написать программу, которая выводит на экран результат следующих опреаций:
            // -5 + 8*6
            // (55+9)%9
            //4.написать программу, выводящую на экран занчение переменной типа инт в квадрате. Предварительно
            // обьявите эту переменную и задайте ее значение



}