public class Main2 {
    public static void main(String[] args) {
        int flask1=150 & flask2<100;
        int flask2=100;
        int flask3=100;

        /*
        Допустим, у вас есть прибор, у которого есть 3 колбы. Каждая колба имеет датчик температуры. Считается, что прибор работает правильно, если температура в одной из трех колб (не известно в какой) температура более 150 градусов, а в остальных менее100 градусов, и при этом сумма температур всех трех колб не превышает 250 градусов.
         */

        boolean res0 = flask1>150^flask2>150^flask3>150;
        System.out.println(res0);

    }
}